In [17]:
import pandas as pd
dt=pd.read_excel('Groups.xlsx')
dt

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [18]:
dt.head()

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26

In [19]:
dt.head(2)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13

In [20]:
dt.tail(3)

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21

In [21]:
dt.shape

(7, 3)

In [22]:
dt.columns

Index(['Group A', 'Group B', 'Group C'], dtype='object')

In [23]:
dt.dtypes

Group A    int64
Group B    int64
Group C    int64
dtype: object

In [24]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Group A  7 non-null      int64
 1   Group B  7 non-null      int64
 2   Group C  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [25]:
dt['Group A']

0    23
1    21
2    19
3    23
4    23
5    22
6    26
Name: Group A, dtype: int64

In [26]:
dt[['Group A']]

   Group A
0       23
1       21
2       19
3       23
4       23
5       22
6       26

In [27]:
dt.sample(2)

   Group A  Group B  Group C
3       23       29       23
1       21       21       13

In [28]:
dt.sample(2)

   Group A  Group B  Group C
5       22       30       29
4       23       28       26

In [29]:
dt.sample(2)

   Group A  Group B  Group C
2       19       25       31
5       22       30       29

In [30]:
dt.sample

<bound method NDFrame.sample of    Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21>

In [31]:
dt.sample(3)

   Group A  Group B  Group C
5       22       30       29
6       26       24       21
4       23       28       26

In [32]:
dt[['Group A']].head(2)

   Group A
0       23
1       21

In [33]:
dt[['Group C']].head(2)

   Group C
0       14
1       13

In [34]:
dt[['Group C']].tail(2)

   Group C
5       29
6       21

In [35]:
dt[2:7]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [36]:
dt[2:6]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29

In [37]:
dt[2:5]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26

In [38]:
dt[-2:]

   Group A  Group B  Group C
5       22       30       29
6       26       24       21

In [39]:
dt[-3:]

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21